#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_storage_bucket.ethical_jobs_cloudbuild_stg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "ethical-jobs-cloudbuild-stg-test"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "pod-n-shubham-awasthi"
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[1m  # google_storage_bucket.ethical_jobs_cloudbuild_stg-03062022[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg-03062022" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "ethical-jobs-cloudbuild-stg-03062022"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "pod-n-shubham-awasthi"
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[1m  # google_storage_bucket.ethical_jobs_cloudbuild_stg-new[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg-new" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "ethical-jobs-cloudbuild-stg-test-new"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "pod-n-shubham-awasthi"
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[1m  # google_storage_bucket.ethical_jobs_web_files_stg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "ethical_jobs_web_files_stg" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "AUSTRALIA-SOUTHEAST1"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "ethical-jobs-web-files-stg-test"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "pod-n-shubham-awasthi"
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[1m  # google_storage_bucket.terraform_state_ej_stg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "terraform_state_ej_stg" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "AUSTRALIA-SOUTHEAST1"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "terraform-state-ej-stg-test"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "pod-n-shubham-awasthi"
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[0m[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>